<?php
include('/var/www/www-root/data/www/api.v.2.byfly.kz/config.php');
function randomSleep()
{
    sleep(rand(5, 10));
}

$listUserDB = $db->query("SELECT * FROM registrations_oskemen");

while ($listUser = $listUserDB->fetch_assoc()) {
    $listUser['phone'] = preg_replace('/\D/', '', $listUser['phone']);

    $message = "👋 Привет!\n\n"
        . "Вы успешно зарегистрированы на грандиозное мероприятие ByFly Travel! ✈️\n"
        . "И это будет не просто встреча, а настоящее приключение! 🚀\n\n"
        . "📍 Адрес: Мызы 16\n"
        . "🕒 Время начала: 15:00\n\n"
        . "🎉 Вас ждёт:\n"
        . "• Розыгрыш стильных чемоданов 🧳\n"
        . "• Множество ценных призов 🎁\n"
        . "• Уникальные инструменты для увеличения заработка 💰\n"
        . "• А главное – шанс выиграть крутое путешествие мечты! 🌍✈️\n\n"
        . "🎫 Ваш персональный билет уже готов:\n"
        . "👉 https://oskemen.byfly.kz/login.php?id=" . $listUser['id'] . "\n\n"
        . "Не упустите возможность изменить свою жизнь к лучшему! 🔥\n"
        . "До скорой встречи – будет незабываемо! 🙌";

    sendWhatsapp($listUser['phone'], $message);

    randomSleep();
}
?>