<?php
if (empty($_POST['my_id']) == false and empty($_POST['user_id']) == false) {
    $userInfo = $db->query("SELECT * FROM users WHERE id='" . $_POST['user_id'] . "'")->fetch_assoc();
    $myInfo = $db->query("SELECT * FROM users WHERE id='" . $_POST['my_id'] . "'")->fetch_assoc();
    if ($userInfo['present_comands_id'] != 0 || $userInfo['present_comands_id'] != '0') {
        echo json_encode(
            array(
                "type" => false,
                "msg" => "Пользователь уже является частью другой команды!"
            ),
            JSON_UNESCAPED_UNICODE
        );
    } else {
        if ($userInfo['astestation_bal'] >= 92) {
            if ($db->query("UPDATE users SET present_comands_id='" . $_POST['my_id'] . "' WHERE id='" . $_POST['user_id'] . "'")) {
                sendWhatsapp(
                    $userInfo['phone'],
                    "🎉 Поздравляем, вы стали членом команды презентеров ByFly! 🎉\n\nВаш куратор: *{$myInfo['name']} {$myInfo['famale']}*\n📞 +{$myInfo['phone']}\n\nТеперь у вас есть возможность назначать презентации и зарабатывать от каждого проплаченного агента. 💼💰\n\n✨ *С чего начать?*\n1️⃣ Зайдите в приложение и перейдите в раздел *Агент*.\n2️⃣ Назначьте удобные для вас даты презентаций.\n3️⃣ Согласуйте расходы с куратором.\n4️⃣ Проведите запланированные презентации.\n5️⃣ Получите заслуженный доход! 🏆\n\nКомпания ByFly высоко ценит ваш вклад и готова поддерживать вас на каждом этапе. 🚀\n\n💡 Если у вас есть вопросы или вам нужна помощь, смело обращайтесь!\n\n*С уважением, команда ByFly Travel.* 🌍"
                );

                sendWhatsapp(
                    $myInfo['phone'],
                    "👥 В вашу команду презентеров добавлен новый пользователь:\n\n👤 *{$userInfo['name']} {$userInfo['famale']}*\n📞 +{$userInfo['phone']}\n\nПожалуйста, свяжитесь с новым участником и помогите ему сделать первые шаги в работе. 🙌"
                );
                echo json_encode(
                    array(
                        "type" => true,
                        "data" => array(),
                    ),
                    JSON_UNESCAPED_UNICODE
                );
            } else {
                echo json_encode(
                    array(
                        "type" => false,
                        "msg" => $db->error
                    ),
                    JSON_UNESCAPED_UNICODE
                );
            }
        } else {
            echo json_encode(
                array(
                    "type" => false,
                    "msg" => "Частью команды может быть только обученный агент компании ByFly Travel сдавший экзамен минимум на 92 балла."
                ),
                JSON_UNESCAPED_UNICODE
            );
        }

    }

} else {
    echo json_encode(
        array(
            "type" => false,
            "msg" => "Empty user_id variable."
        ),
        JSON_UNESCAPED_UNICODE
    );
}

?>