<?php
if ($db->query("UPDATE users SET present_comands_id='0' WHERE id='" . $_POST['user_id'] . "'")) {
    $userInfo = $db->query("SELECT * FROM users WHERE id='" . $_POST['user_id'] . "'")->fetch_assoc();
    sendWhatsapp(
        $userInfo['phone'],
        "⚠️ Уведомление от ByFly Travel ⚠️\n\nУважаемый(ая) *{$userInfo['name']} {$userInfo['famale']}*,\n\nК сожалению, вы были исключены из команды презентеров. Если это произошло по ошибке или у вас есть вопросы, пожалуйста, свяжитесь с вашим куратором или поддержкой компании.\n\nСпасибо за вашу работу и вклад!\n\n*С уважением, команда ByFly Travel.* 🌍"
    );
    echo json_encode(
        array(
            "type" => true,
            "data" => "Пользователь удален из команды!",
        ),
        JSON_UNESCAPED_UNICODE
    );
} else {
    echo json_encode(
        array(
            "type" => false,
            "msg" => "Не удалось удалить члена команды презентеров! " . $db->error,
        ),
        JSON_UNESCAPED_UNICODE
    );
}
?>